## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_hub.virtual_hub will be created
  + resource "azurerm_virtual_hub" "virtual_hub" {
      + address_prefix                         = "10.200.0.0/22"
      + default_route_table_id                 = (known after apply)
      + hub_routing_preference                 = "ExpressRoute"
      + id                                     = (known after apply)
      + location                               = "eastus2"
      + name                                   = "example-virtualhub"
      + resource_group_name                    = "accern-nwsvcs-prd-eus2-rg"
      + virtual_router_asn                     = (known after apply)
      + virtual_router_auto_scale_min_capacity = 2
      + virtual_router_ips                     = (known after apply)
      + virtual_wan_id                         = (known after apply)
    }

  # azurerm_virtual_wan.virtual_wan will be created
  + resource "azurerm_virtual_wan" "virtual_wan" {
      + allow_branch_to_branch_traffic    = true
      + disable_vpn_encryption            = false
      + id                                = (known after apply)
      + location                          = "eastus2"
      + name                              = "example-virtualwan"
      + office365_local_breakout_category = "None"
      + resource_group_name               = "accern-nwsvcs-prd-eus2-rg"
      + type                              = "Standard"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>